app/controllers/assets_controller.rb

SELECT "assets".* FROM "assets" WHERE "assets"."venue_id" = 1
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    @assets = Venue.find(params[:venue_id]).assets

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @venue = Venue.find(params[:venue_id])
    @asset = Asset.find(params[:id])

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def new
    @venue = Venue.find(params[:venue_id])

SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @asset = Asset.find(params[:id])

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "assets" ("assetType", "created_at", "location", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @venue = Venue.find(params[:venue_id])
    @asset = Asset.new(params[:asset])
    @asset.venue = @venue

    respond_to do |format|
      if @asset.save

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "assets" WHERE "assets"."id" = $1  [["id", 3]]
---
  def destroy
    @venue = Venue.find(params[:venue_id])
    @asset = Asset.find(params[:id])
    @asset.destroy