app/controllers/attraction_tours_controller.rb

SELECT "attraction_tours".* FROM "attraction_tours" WHERE "attraction_tours"."tour_id" = 1
SELECT "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "attraction_tours".* FROM "attraction_tours"
---
  def index
    if params.has_key?(:tour_id)
      @attraction_tours = Tour.find(params[:tour_id]).attraction_tours
    else
      @attraction_tours = AttractionTour.all

SELECT "attraction_tours".* FROM "attraction_tours" WHERE "attraction_tours"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
    @attraction_tour = AttractionTour.find(params[:id])

SELECT "attraction_tours".* FROM "attraction_tours" WHERE "attraction_tours"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @attraction_tour = AttractionTour.find(params[:id])

SELECT "attraction_tours".* FROM "attraction_tours" WHERE "attraction_tours"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "attraction_tours" SET "description" = 'this is the first stop', "order" = 1, "updated_at" = '2013-06-11 17:27:47.302959' WHERE "attraction_tours"."id" = 1
---
  def update
    @attraction_tour = AttractionTour.find(params[:id])

    respond_to do |format|
      if @attraction_tour.update_attributes(params[:attraction_tour])