app/controllers/attractions_controller.rb

  def index
    if(params.has_key?(:venue_id))
      @venue = Venue.find(params[:venue_id])
      @attractions = @venue.attractions
    else
      @attractions = Attraction.all
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "attractions".* FROM "attractions" WHERE "attractions"."venue_id" = 2

  def show
    @attraction = Attraction.find(params[:id])
---
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    if(params.has_key?(:venue_id))
      @venue = Venue.find(params[:venue_id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @venue = Venue.find(params[:venue_id])
    @attraction = Attraction.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @venue = Venue.find(params[:venue_id])
    @attraction = Attraction.new(params[:attraction])
    @attraction.venue = @venue

    respond_to do |format|
      if @attraction.save
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "attractions" ("description", "latitude", "longitude", "radius", "title", "venue_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "this is mars.  it's small and it's red."], ["latitude", 243.4342], ["longitude", 23.543], ["radius", 5.0], ["title", "mars"], ["venue_id", 1]]

  def update
    @venue = Venue.find(params[:venue_id])
    @attraction = Attraction.find(params[:id])

    respond_to do |format|
      if @attraction.update_attributes(params[:attraction])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "attractions" SET "title" = 'another attraction', "updated_at" = '2013-06-09 23:07:42.117136' WHERE "attractions"."id" = 6

  def destroy
    @attraction = Attraction.find(params[:id])
    @venue = @attraction.venue
    @attraction.destroy
---
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "attractions" WHERE "attractions"."id" = ?  [["id", 1]]