app/controllers/locations_controller.rb

INSERT INTO "locations" ("created_at", "description", "double", "id", "latitude", "longitude", "radius", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save