app/controllers/media_controller.rb

INSERT INTO "media" ("content", "media_type", "multimedia_id", "multimedia_type") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "http://www.youtube.com/watch?v=3udFd1DOmIw"], ["media_type", "video"], ["multimedia_id", 1], ["multimedia_type", "Tour"]]
---
  def create
    @multimedia = find_media
    #@medium = Medium.new(params[:medium])
    @medium = @multimedia.media.build(params[:medium])

    #respond_to do |format|
      if @medium.save