app/controllers/time_visitors_controller.rb

SELECT "time_visitors".* FROM "time_visitors" WHERE "time_visitors"."tour_visitor_id" = 2
SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "time_visitors".* FROM "time_visitors"
---
  def index
    if(params.has_key?(:tour_visitor_id))
      @time_visitors = TourVisitor.find(params[:tour_visitor_id]).time_visitors
    else
      @time_visitors = TimeVisitor.all

SELECT "time_visitors".* FROM "time_visitors" WHERE "time_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
    @tour_visitor = TourVisitor.find(params[:tour_visitor_id])

SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def new
    @tour_visitor = TourVisitor.find(params[:tour_visitor_id])

SELECT "time_visitors".* FROM "time_visitors" WHERE "time_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @tour_visitor = TourVisitor.find(params[:tour_visitor_id])

INSERT INTO "time_visitors" ("created_at", "latitude", "longitude", "tour_visitor_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 26 Jun 2013 19:24:27 UTC +00:00], ["latitude", 20.4353], ["longitude", 23.54564], ["tour_visitor_id", 2], ["updated_at", Wed, 26 Jun 2013 19:24:27 UTC +00:00]]
---
  def create
    @tour_visitor = TourVisitor.find(params[:tour_visitor_id])
    @time_visitor = @tour_visitor.time_visitors.create(params[:time_visitor])

SELECT "time_visitors".* FROM "time_visitors" WHERE "time_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "time_visitors" SET "longitude" = 10.0, "updated_at" = '2013-06-27 16:06:48.708583' WHERE "time_visitors"."id" = 1
---
  def update
    @tour_visitor = TourVisitor.find(params[:tour_visitor_id])
    @time_visitor = TimeVisitor.find(params[:id])

    respond_to do |format|
      if @time_visitor.update_attributes(params[:time_visitor])

SELECT "time_visitors".* FROM "time_visitors" WHERE "time_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "time_visitors" WHERE "time_visitors"."id" = $1  [["id", 1]]
---
  def destroy
    @time_visitor = TimeVisitor.find(params[:id])
    @time_visitor.destroy