app/controllers/tour_visitors_controller.rb

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tour_visitors".* FROM "tour_visitors"
---
  def index
    if(params.has_key?(:venue_visitors_id))
      @tour_visitors = VenueVisitor.find(params[:venue_visitor_id]).tour_visitors
    else
      @tour_visitors = TourVisitor.all

SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    if(params.has_key?(:venue_visitors_id))
      @tour_visitors = VenueVisitor.find(params[:venue_visitor_id]).tour_visitors

SELECT "venue_visitors".* FROM "venue_visitors" WHERE "venue_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def new
    @venue_visitor = VenueVisitor.find(params[:venue_visitor_id])

SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "venue_visitors".* FROM "venue_visitors" WHERE "venue_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @venue_visitor = VenueVisitor.find(params[:venue_visitor_id])

SELECT "venue_visitors".* FROM "venue_visitors" WHERE "venue_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "tour_visitors" ("created_at", "progress", "tour_id", "updated_at", "venue_visitor_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 27 Jun 2013 15:14:24 UTC +00:00], ["progress", 1], ["tour_id", 1], ["updated_at", Thu, 27 Jun 2013 15:14:24 UTC +00:00], ["venue_visitor_id", 1]]
---
  def create
    @venue_visitor = VenueVisitor.find(params[:venue_visitor_id])
    @tour_visitor = TourVisitor.new(params[:tour_visitor])

    respond_to do |format|
      if @tour_visitor.save

SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tour_visitors" SET "visitor_id" = 1, "progress" = 0, "updated_at" = '2013-06-13 23:59:08.323426' WHERE "tour_visitors"."id" = 1
---
  def update
    # @venue_visitor = VenueVisitor.find(params[:venue_visitor_id])
    @tour_visitor = TourVisitor.find(params[:id])

    respond_to do |format|
      if @tour_visitor.update_attributes(params[:tour_visitor])

SELECT "tour_visitors".* FROM "tour_visitors" WHERE "tour_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "tour_visitors" WHERE "tour_visitors"."id" = $1  [["id", 1]]
---
  def destroy
    @tour_visitor = TourVisitor.find(params[:id])
    @tour_visitor.destroy