app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours" WHERE "tours"."venue_id" = 1
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tours".* FROM "tours"
---
  def index
    if(params.has_key?(:venue_id))
      @tours = Venue.find(params[:venue_id]).tours
    else
      @tours = Tour.all

SELECT "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tour = Tour.find(params[:id])

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def new
    @venue = Venue.find(params[:venue_id])

SELECT "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", "10"]]
---
  def edit
    @tour = Tour.find(params[:id])

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "tours" ("description", "title", "venue_id") VALUES ($1, $2, $3) RETURNING "id"  [["description", "tour tour tour tour tour"], ["title", "some other tour"], ["venue_id", 1]]
---
  def create
    @venue = Venue.find(params[:venue_id])
    @tour = Tour.new(params[:tour])
    @tour.venue = @venue

    respond_to do |format|
      if @tour.save

SELECT "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", "10"]]
UPDATE "tours" SET "title" = 'another tour part four!', "updated_at" = '2013-06-09 23:03:10.298589' WHERE "tours"."id" = 12
---
  def update
    @tour = Tour.find(params[:id])

    respond_to do |format|
      if @tour.update_attributes(params[:tour])

SELECT "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", "12"]]
DELETE FROM "tours" WHERE "tours"."id" = $1  [["id", 12]]
---
  def destroy
    @tour = Tour.find(params[:id])
    @venue = @tour.venue
    @tour.destroy

SELECT "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", "10"]]
---
  def attractions
    @tour = Tour.find(params[:tour_id])