app/controllers/venue_visitors_controller.rb

SELECT "venue_visitors".* FROM "venue_visitors"
---
  def index
    @venue_visitors = VenueVisitor.all

SELECT "venue_visitors".* FROM "venue_visitors" WHERE "venue_visitors"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @venue_visitor = VenueVisitor.find(params[:id])