app/controllers/venue_assets_controller.rb

  def index
    @venue_assets = VenueAsset.all
---
SELECT "venue_assets".* FROM "venue_assets"