app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tours".* FROM "tours" WHERE "tours"."venue_id" = 1
---
  def show
    @venue = Venue.find(params[:id])
    @attractions = @venue.attractions
    @tours = @venue.tours
    # @inactive_tours = @tours.where('active = false')
    @active_tours = @tours.where('active = true')

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @venue = Venue.find(params[:id])

INSERT INTO "venues" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 03 Jun 2013 14:27:10 UTC +00:00], ["description", "The Rochester Institute of Technology"], ["name", "RIT"], ["updated_at", Mon, 03 Jun 2013 14:27:10 UTC +00:00]]
---
  def create
    @venue = Venue.new(params[:venue])

    respond_to do |format|
      if @venue.save

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "venues" SET "description" = 'This is a fresh test. It will just get random stuff added to it probably.', "updated_at" = '2013-06-13 01:17:35.284413' WHERE "venues"."id" = 1
---
  def update
    @venue = Venue.find(params[:id])

    respond_to do |format|
      if @venue.update_attributes(params[:venue])

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "venues" WHERE "venues"."id" = $1  [["id", 2]]
---
  def destroy
    @venue = Venue.find(params[:id])
    @venue.destroy