app/controllers/visitors_controller.rb

  def index
    @visitors = Visitor.all
---
SELECT "visitors".* FROM "visitors"

  def show
    @visitor = Visitor.find(params[:id])
---
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "2"]]

  def edit
    @visitor = Visitor.find(params[:id])
---
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @visitor = Visitor.new(params[:visitor])
    respond_to do |format|
      if @visitor.save
---
INSERT INTO "visitors" ("created_at", "oid", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 31 May 2013 15:37:20 UTC +00:00], ["oid", nil], ["updated_at", Fri, 31 May 2013 15:37:20 UTC +00:00]]

  def update
    @visitor = Visitor.find(params[:id])
---
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "new"]]

  def destroy
    @visitor = Visitor.find(params[:id])
    @visitor.destroy
---
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "visitors" WHERE "visitors"."id" = $1  [["id", 1]]